Revit 2024 API
BuiltInFailures.WallJoinFailures.FailedToChangeWallJointsTypeFailure Property
 Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FailedToChangeWallJointsTypeFailure { get; }
Visual Basic
Public Shared ReadOnly Property FailedToChangeWallJointsTypeFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FailedToChangeWallJointsTypeFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallJoinFailures Class
Autodesk.Revit.DB Namespace